<a href="https://colab.research.google.com/github/dubba1212/AIML/blob/master/Assignement_11(8_06_2020).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Experiment pivot_table() function on given DataFrame

In [0]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo", "bar", "bar", "bar", "bar"],
                             "B": ["one", "one", "one", "two", "two", "one", "one", "two", "two"],
                               "C": ["small", "large", "large", "small","small", "large", "small", "small","large"],
                               "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                               "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [0]:
df.pivot(index='E', columns='C', values='B')

C large small
E
2   NaN   one
4   one   NaN
5   one   two
6   one   two
8   NaN   one
9   two   two

In [0]:
df.pivot(index='E', columns='C')['B']

C large small
E
2   NaN   one
4   one   NaN
5   one   two
6   one   two
8   NaN   one
9   two   two

2. Experiment How to store a pandas DataFrame as csv file

In [0]:
df.to_csv("file1.csv")

In [0]:
#Export without the index
df.to_csv("file1.csv",index=False)

3. For IPL_2018 and IPL_2017 DataFrame finds the sum of both DataFrames and store the result in the DataFrame with the name Total.

-->Creating a new column to Total DataFrame - 'Win Percentage' and values of that column will be matches won/matches played.

-->Sort the teams with the most number of wins.If the number of wins of two teams are the same, sort by the win percentage.

In [0]:
IPL_2018 = pd.DataFrame({'IPL Team': ['CSK', 'SRH', 'KKR', 'RR', 'MI', 'RCB', 'KXIP', 'DD'],
                         'Matches Played': [16, 17, 16, 15, 14, 14, 14, 14],
                         'Matches Won': [11, 10, 9, 7, 6, 6, 6, 5]}
                       )

# Set the 'IPL Team' column as the index to perform arithmetic operations on the other rows using the team as reference
IPL_2018.set_index('IPL Team', inplace = True)
IPL_2018

          Matches Played  Matches Won
IPL Team
CSK                   16           11
SRH                   17           10
KKR                   16            9
RR                    15            7
MI                    14            6
RCB                   14            6
KXIP                  14            6
DD                    14            5

In [0]:
IPL_2017 = pd.DataFrame({'IPL Team': ['MI', 'RPS', 'KKR', 'SRH', 'KXIP', 'DD', 'GL', 'RCB'],
                         'Matches Played': [17, 16, 16, 15, 14, 14, 14, 14],
                         'Matches Won': [12, 10, 9, 8, 7, 6, 4, 3]}
                       )
IPL_2017.set_index('IPL Team', inplace = True)
IPL_2017

          Matches Played  Matches Won
IPL Team
MI                    17           12
RPS                   16           10
KKR                   16            9
SRH                   15            8
KXIP                  14            7
DD                    14            6
GL                    14            4
RCB                   14            3

In [0]:
Total = IPL_2018*IPL_2017
Total

          Matches Played  Matches Won
IPL Team
CSK                  NaN          NaN
DD                 196.0         30.0
GL                   NaN          NaN
KKR                256.0         81.0
KXIP               196.0         42.0
MI                 238.0         72.0
RCB                196.0         18.0
RPS                  NaN          NaN
RR                   NaN          NaN
SRH                255.0         80.0

In [38]:
Total = IPL_2018.mul(IPL_2017,fill_value=0)
Total

          Matches Played  Matches Won
IPL Team
CSK                  0.0          0.0
DD                 196.0         30.0
GL                   0.0          0.0
KKR                256.0         81.0
KXIP               196.0         42.0
MI                 238.0         72.0
RCB                196.0         18.0
RPS                  0.0          0.0
RR                   0.0          0.0
SRH                255.0         80.0

->Creating a new column to Total DataFrame - 'Win Percentage' and values of that column will be matches won/matches played.

In [42]:
Total['Win percentage']=Total['Matches Played']/Total['Matches Won']*100
Total

          Matches Played  Matches Won  Win percentage
IPL Team
CSK                  0.0          0.0             NaN
DD                 196.0         30.0      653.333333
GL                   0.0          0.0             NaN
KKR                256.0         81.0      316.049383
KXIP               196.0         42.0      466.666667
MI                 238.0         72.0      330.555556
RCB                196.0         18.0     1088.888889
RPS                  0.0          0.0             NaN
RR                   0.0          0.0             NaN
SRH                255.0         80.0      318.750000


-->Sort the teams with the most number of wins.If the number of wins of two teams are the same, sort by the win percentage.

In [25]:
IPL_2018.sort_values(by="Matches Won",ascending=True)

          Matches Played  Matches Won
IPL Team
DD                    14            5
MI                    14            6
RCB                   14            6
KXIP                  14            6
RR                    15            7
KKR                   16            9
SRH                   17           10
CSK                   16           11

In [26]:
IPL_2017.sort_values(by="Matches Won",ascending=True)

          Matches Played  Matches Won
IPL Team
RCB                   14            3
GL                    14            4
DD                    14            6
KXIP                  14            7
SRH                   15            8
KKR                   16            9
RPS                   16           10
MI                    17           12